contiki-os/contiki/cc26xxware/inc/hw_adi.h
                                            // only bits selected by mask M1
                                            // will be affected by access
#define ADI_MASK8B1213_D1_S     16
#define ADI_MASK8B1213_M0_M     0x0000FF00  // Mask for ADI register 12
#define ADI_MASK8B1213_M0_S     8
#define ADI_MASK8B1213_D0_M     0x000000FF  // Data for ADI register 12, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define ADI_MASK8B1213_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1415 register.
//
//*****************************************************************************
#define ADI_MASK8B1415_M1_M     0xFF000000  // Mask for ADI register 15
#define ADI_MASK8B1415_M1_S     24
#define ADI_MASK8B1415_D1_M     0x00FF0000  // Data for ADI register 15, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define ADI_MASK8B1415_D1_S     16
#define ADI_MASK8B1415_M0_M     0x0000FF00  // Mask for ADI register 14
#define ADI_MASK8B1415_M0_S     8
#define ADI_MASK8B1415_D0_M     0x000000FF  // Data for ADI register 14, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define ADI_MASK8B1415_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B01 register.
//
//*****************************************************************************
#define ADI_MASK16B01_M_M       0xFFFF0000  // Mask for ADI register 0 and 1
#define ADI_MASK16B01_M_S       16
#define ADI_MASK16B01_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 0 and 1, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B01_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B23 register.
//
//*****************************************************************************
#define ADI_MASK16B23_M_M       0xFFFF0000  // Mask for ADI register 2 and 3
#define ADI_MASK16B23_M_S       16
#define ADI_MASK16B23_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 2 and 3, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B23_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B45 register.
//
//*****************************************************************************
#define ADI_MASK16B45_M_M       0xFFFF0000  // Mask for ADI register 4 and 5
#define ADI_MASK16B45_M_S       16
#define ADI_MASK16B45_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 4 and 5, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B45_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B67 register.
//
//*****************************************************************************
#define ADI_MASK16B67_M_M       0xFFFF0000  // Mask for ADI register 6 and 7
#define ADI_MASK16B67_M_S       16
#define ADI_MASK16B67_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 6 and 7, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B67_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B89 register.
//
//*****************************************************************************
#define ADI_MASK16B89_M_M       0xFFFF0000  // Mask for ADI register 8 and 9
#define ADI_MASK16B89_M_S       16
#define ADI_MASK16B89_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 8 and 9, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B89_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1011 register.
//
//*****************************************************************************
#define ADI_MASK16B1011_M_M     0xFFFF0000  // Mask for ADI register 10 and 11
#define ADI_MASK16B1011_M_S     16
#define ADI_MASK16B1011_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 10 and 11, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1011_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1213 register.
//
//*****************************************************************************
#define ADI_MASK16B1213_M_M     0xFFFF0000  // Mask for ADI register 12 and 13
#define ADI_MASK16B1213_M_S     16
#define ADI_MASK16B1213_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 12 and 13, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1213_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1415 register.
//
//*****************************************************************************
#define ADI_MASK16B1415_M_M     0xFFFF0000  // Mask for ADI register 14 and 15
#define ADI_MASK16B1415_M_S     16
#define ADI_MASK16B1415_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 14 and 15, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1415_D_S     0

#endif // __HW_ADI_H__
